; domain
(define (domain blocks)
  (:requirements :adl)
  (:predicates
    (hand-empty)
    (holding ?x)
    (on-top ?x ?y) 
    (on-floor ?x)   
    (clear ?x)     
  )
  
  (:action podnies-z-paczki
    :parameters (?x ?y)
    :precondition (and (on-top ?x ?y) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (clear ?y) (not (on-top ?x ?y)) (not(hand-empty)) )
  )

  (:action podnies-z-podlogi
    :parameters (?x)
    :precondition (and (on-floor ?x) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (not (on-floor ?x)) (not (hand-empty)) )
  )

  (:action opusc-na-podloge
    :parameters (?x)
    :precondition (holding ?x)
    :effect (and (on-floor ?x) (clear ?x) (hand-empty) (not(holding ?x)) )
  )

  (:action opusc-na-paczke
    :parameters (?y ?x)
    :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)) )
    :effect (and (on-top ?x ?y) (clear ?x) (hand-empty) (not (holding ?x)) (not (clear ?y)))
  )
)

; problem
(define (problem p1)
    (:domain blocks)
    (:objects
        a b c d e
    )
    (:init
        (clear c)
        (on-top c b)
        (on-top b a)
        (on-floor a)
        (clear e)
        (on-top e d)
        (on-floor d)
        (hand-empty)
    )
    (:goal (and
       (on-top d b)
       (on-top b a)
       (clear d)
    ))
)

; plan
1. (podnies-z-paczki e d)
   deleted: (on-top e d) (hand-empty)
   added: (holding e) (clear d)
   goals met: 2 of 3
2. (opusc-na-podloge e)
   deleted: (holding e)
   added: (on-floor e) (hand-empty)
   goals met: 2 of 3
3. (podnies-z-paczki c b)
   deleted: (on-top c b) (hand-empty)
   added: (holding c) (clear b)
   goals met: 2 of 3
4. (opusc-na-podloge c)
   deleted: (holding c)
   added: (on-floor c) (hand-empty)
   goals met: 2 of 3
5. (podnies-z-podlogi d)
   deleted: (on-floor d) (hand-empty)
   added: (holding d)
   goals met: 2 of 3
6. (opusc-na-paczke b d)
   deleted: (holding d) (clear b)
   added: (on-top d b) (hand-empty)
   goals met: 3 of 3
